api/modules/v1/controllers/CompanyController.php

    public function actionIndex()
    {
        $model = University::find()->select(['id','title', 'total'])->all();
---
SELECT "id", "title", "total" FROM "university"